# 1. Pandas Basic

## import

In [1]:
import numpy as np
import pandas as pd

## 생성

In [2]:
order_url = 'https://bit.ly/dsa-01-order'
order = pd.read_csv(order_url)
order

   id  user_id  product_id        date  price  address      state
0   1        3           9  2017-01-01    500    Seoul  confirmed
1   2        1           7  2017-01-03    700    Seoul  confirmed
2   3        3           8  2017-01-03    900  Daejeon  confirmed
3   4        4           2  2017-01-07    500      NaN   canceled
4   5        7           3  2017-01-09    700  Incheon  confirmed
5   6        5           7  2017-01-09    600    Busan   canceled
6   7        2           5  2017-01-10    200      NaN   canceled

In [3]:
order = order.set_index('id')
order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [4]:
print(type(order.index))
order.index

<class 'pandas.core.indexes.numeric.Int64Index'>

Int64Index([1, 2, 3, 4, 5, 6, 7], dtype='int64', name='id')

In [5]:
print(type(order.columns))
order.columns

<class 'pandas.core.indexes.base.Index'>

Index(['user_id', 'product_id', 'date', 'price', 'address', 'state'], dtype='object')

In [6]:
print(type(order.values))
order.values

<class 'numpy.ndarray'>

array([[3, 9, '2017-01-01', 500, 'Seoul', 'confirmed'],
       [1, 7, '2017-01-03', 700, 'Seoul', 'confirmed'],
       [3, 8, '2017-01-03', 900, 'Daejeon', 'confirmed'],
       [4, 2, '2017-01-07', 500, nan, 'canceled'],
       [7, 3, '2017-01-09', 700, 'Incheon', 'confirmed'],
       [5, 7, '2017-01-09', 600, 'Busan', 'canceled'],
       [2, 5, '2017-01-10', 200, nan, 'canceled']], dtype=object)

In [7]:
order.columns = ['user_id', 'product_id', 'date', 'amount', 'address', 'result']
order

    user_id  product_id        date  amount  address     result
id
1         3           9  2017-01-01     500    Seoul  confirmed
2         1           7  2017-01-03     700    Seoul  confirmed
3         3           8  2017-01-03     900  Daejeon  confirmed
4         4           2  2017-01-07     500      NaN   canceled
5         7           3  2017-01-09     700  Incheon  confirmed
6         5           7  2017-01-09     600    Busan   canceled
7         2           5  2017-01-10     200      NaN   canceled

## 기본 연산

In [8]:
print(order['amount'].mean())
print(order['amount'].min())
print(order['amount'].max())
print(order['amount'].describe())

585.7142857142857
200
900
count      7.000000
mean     585.714286
std      219.306266
min      200.000000
25%      500.000000
50%      600.000000
75%      700.000000
max      900.000000
Name: amount, dtype: float64

In [9]:
order['result'].unique()

array(['confirmed', 'canceled'], dtype=object)

In [10]:
order['result'].value_counts()

confirmed    4
canceled     3
Name: result, dtype: int64

In [11]:
# 전체 중에서의 비율
order['result'].value_counts(normalize=True)

confirmed    0.571429
canceled     0.428571
Name: result, dtype: float64

## value 변경

In [12]:
order['result'] = order['result'].replace('confirmed', 'confirm').replace('canceled', 'cancel')
order

    user_id  product_id        date  amount  address   result
id
1         3           9  2017-01-01     500    Seoul  confirm
2         1           7  2017-01-03     700    Seoul  confirm
3         3           8  2017-01-03     900  Daejeon  confirm
4         4           2  2017-01-07     500      NaN   cancel
5         7           3  2017-01-09     700  Incheon  confirm
6         5           7  2017-01-09     600    Busan   cancel
7         2           5  2017-01-10     200      NaN   cancel

## datetime으로 변경

In [13]:
order['date'] = pd.to_datetime(order['date'])
order['date'].dt.year

id
1    2017
2    2017
3    2017
4    2017
5    2017
6    2017
7    2017
Name: date, dtype: int64

## 행, 열 검색

In [14]:
order['date']

id
1   2017-01-01
2   2017-01-03
3   2017-01-03
4   2017-01-07
5   2017-01-09
6   2017-01-09
7   2017-01-10
Name: date, dtype: datetime64[ns]

In [15]:
order[['user_id', 'date']]

    user_id       date
id
1         3 2017-01-01
2         1 2017-01-03
3         3 2017-01-03
4         4 2017-01-07
5         7 2017-01-09
6         5 2017-01-09
7         2 2017-01-10

In [16]:
col = ['user_id', 'date', 'amount']
order[col]

    user_id       date  amount
id
1         3 2017-01-01     500
2         1 2017-01-03     700
3         3 2017-01-03     900
4         4 2017-01-07     500
5         7 2017-01-09     700
6         5 2017-01-09     600
7         2 2017-01-10     200

In [17]:
order.loc[4]

user_id                         4
product_id                      2
date          2017-01-07 00:00:00
amount                        500
address                       NaN
result                     cancel
Name: 4, dtype: object

In [18]:
order.loc[[1, 3, 7]]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
7         2           5 2017-01-10     200      NaN   cancel

In [19]:
order.loc[1, 'date']

Timestamp('2017-01-01 00:00:00')

In [20]:
order.loc[[1, 3, 7], 'date']

id
1   2017-01-01
3   2017-01-03
7   2017-01-10
Name: date, dtype: datetime64[ns]

## 색인

In [21]:
order['date'] == '2017-01-03'

id
1    False
2     True
3     True
4    False
5    False
6    False
7    False
Name: date, dtype: bool

In [22]:
order[order['date'] == '2017-01-03']

    user_id  product_id       date  amount  address   result
id
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm

In [23]:
order[order['date'] != '2017-01-03']

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel
7         2           5 2017-01-10     200      NaN   cancel

In [24]:
order[order['amount'] >= 500]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
4         4           2 2017-01-07     500      NaN   cancel
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

In [25]:
date_candidates = ['2017-01-01', '2017-01-05', '2017-01-09']
order[order['date'].isin(date_candidates)]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

In [26]:
order[order['address'].isnull()]

    user_id  product_id       date  amount address  result
id
4         4           2 2017-01-07     500     NaN  cancel
7         2           5 2017-01-10     200     NaN  cancel

In [27]:
order[~order['address'].isnull()]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

In [28]:
order[order['address'].notnull()]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
5         7           3 2017-01-09     700  Incheon  confirm
6         5           7 2017-01-09     600    Busan   cancel

In [29]:
order[(order['amount'] >= 500) & (order['result'] == 'confirm')]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
5         7           3 2017-01-09     700  Incheon  confirm

In [30]:
high = (order['amount'] >= 500)
confirm = (order['result'] == 'confirm')

order[high & confirm]

    user_id  product_id       date  amount  address   result
id
1         3           9 2017-01-01     500    Seoul  confirm
2         1           7 2017-01-03     700    Seoul  confirm
3         3           8 2017-01-03     900  Daejeon  confirm
5         7           3 2017-01-09     700  Incheon  confirm

## 색인 후 검색

In [31]:
order.loc[order['date'] == '2017-01-09', 'amount']

id
5    700
6    600
Name: amount, dtype: int64

In [32]:
order.loc[order['date'] == '2017-01-09', ['date', 'amount']]

         date  amount
id
5  2017-01-09     700
6  2017-01-09     600

## 컬럼 추가 & 수정

In [33]:
order['card-holder'] = 'KB'
order

    user_id  product_id       date  amount  address   result card-holder
id
1         3           9 2017-01-01     500    Seoul  confirm          KB
2         1           7 2017-01-03     700    Seoul  confirm          KB
3         3           8 2017-01-03     900  Daejeon  confirm          KB
4         4           2 2017-01-07     500      NaN   cancel          KB
5         7           3 2017-01-09     700  Incheon  confirm          KB
6         5           7 2017-01-09     600    Busan   cancel          KB
7         2           5 2017-01-10     200      NaN   cancel          KB

In [34]:
order['order'] = [1,2,3,4,5,6,7]
order

,user_id,product_id,date,amount,address,result,card-holder,order
id,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KB,1
2,1,7,2017-01-03,700,Seoul,confirm,KB,2
3,3,8,2017-01-03,900,Daejeon,confirm,KB,3
4,4,2,2017-01-07,500,NaN,cancel,KB,4
5,7,3,2017-01-09,700,Incheon,confirm,KB,5
6,5,7,2017-01-09,600,Busan,cancel,KB,6
7,2,5,2017-01-10,200,NaN,cancel,KB,7

In [35]:
order['VIP'] = order['amount'] >= 500
order

,user_id,product_id,date,amount,address,result,card-holder,order,VIP
id,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KB,1,True
2,1,7,2017-01-03,700,Seoul,confirm,KB,2,True
3,3,8,2017-01-03,900,Daejeon,confirm,KB,3,True
4,4,2,2017-01-07,500,NaN,cancel,KB,4,True
5,7,3,2017-01-09,700,Incheon,confirm,KB,5,True
6,5,7,2017-01-09,600,Busan,cancel,KB,6,True
7,2,5,2017-01-10,200,NaN,cancel,KB,7,False

In [36]:
order['VIP'] = (order['amount'] >= 500) & (order['result'] == 'confirm')
order

,user_id,product_id,date,amount,address,result,card-holder,order,VIP
id,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KB,1,True
2,1,7,2017-01-03,700,Seoul,confirm,KB,2,True
3,3,8,2017-01-03,900,Daejeon,confirm,KB,3,True
4,4,2,2017-01-07,500,NaN,cancel,KB,4,False
5,7,3,2017-01-09,700,Incheon,confirm,KB,5,True
6,5,7,2017-01-09,600,Busan,cancel,KB,6,False
7,2,5,2017-01-10,200,NaN,cancel,KB,7,False

In [37]:
order.loc[order['amount'] >= 500, 'status'] = 'VIP'
order.loc[order['amount'] < 500, 'status'] = 'None-VIP'
order

,user_id,product_id,date,amount,address,result,card-holder,order,VIP,status
id,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KB,1,True,VIP
2,1,7,2017-01-03,700,Seoul,confirm,KB,2,True,VIP
3,3,8,2017-01-03,900,Daejeon,confirm,KB,3,True,VIP
4,4,2,2017-01-07,500,NaN,cancel,KB,4,False,VIP
5,7,3,2017-01-09,700,Incheon,confirm,KB,5,True,VIP
6,5,7,2017-01-09,600,Busan,cancel,KB,6,False,VIP
7,2,5,2017-01-10,200,NaN,cancel,KB,7,False,None-VIP

## 삭제

In [38]:
order.drop('status', axis='columns')

,user_id,product_id,date,amount,address,result,card-holder,order,VIP
id,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KB,1,True
2,1,7,2017-01-03,700,Seoul,confirm,KB,2,True
3,3,8,2017-01-03,900,Daejeon,confirm,KB,3,True
4,4,2,2017-01-07,500,NaN,cancel,KB,4,False
5,7,3,2017-01-09,700,Incheon,confirm,KB,5,True
6,5,7,2017-01-09,600,Busan,cancel,KB,6,False
7,2,5,2017-01-10,200,NaN,cancel,KB,7,False

In [39]:
order.drop(['status', 'VIP'], axis=1)

,user_id,product_id,date,amount,address,result,card-holder,order
id,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KB,1
2,1,7,2017-01-03,700,Seoul,confirm,KB,2
3,3,8,2017-01-03,900,Daejeon,confirm,KB,3
4,4,2,2017-01-07,500,NaN,cancel,KB,4
5,7,3,2017-01-09,700,Incheon,confirm,KB,5
6,5,7,2017-01-09,600,Busan,cancel,KB,6
7,2,5,2017-01-10,200,NaN,cancel,KB,7

In [40]:
order.drop(3, axis='rows')

,user_id,product_id,date,amount,address,result,card-holder,order,VIP,status
id,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KB,1,True,VIP
2,1,7,2017-01-03,700,Seoul,confirm,KB,2,True,VIP
4,4,2,2017-01-07,500,NaN,cancel,KB,4,False,VIP
5,7,3,2017-01-09,700,Incheon,confirm,KB,5,True,VIP
6,5,7,2017-01-09,600,Busan,cancel,KB,6,False,VIP
7,2,5,2017-01-10,200,NaN,cancel,KB,7,False,None-VIP

## apply

In [41]:
def is_vip(amount):
    if amount >= 500:
        return 'VIP'
    else:
        return 'None-VIP'
    
order['vip'] = order['amount'].apply(is_vip)
order

,user_id,product_id,date,amount,address,result,card-holder,order,VIP,status,vip
id,,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KB,1,True,VIP,VIP
2,1,7,2017-01-03,700,Seoul,confirm,KB,2,True,VIP,VIP
3,3,8,2017-01-03,900,Daejeon,confirm,KB,3,True,VIP,VIP
4,4,2,2017-01-07,500,NaN,cancel,KB,4,False,VIP,VIP
5,7,3,2017-01-09,700,Incheon,confirm,KB,5,True,VIP,VIP
6,5,7,2017-01-09,600,Busan,cancel,KB,6,False,VIP,VIP
7,2,5,2017-01-10,200,NaN,cancel,KB,7,False,None-VIP,None-VIP

In [42]:
def is_vip(row):
    amount = row['amount']
    result = row['result']
    
    if amount >= 500 and result == 'confirm':
        return 'VIP'
    else:
        return 'None-VIP'
    
order['status'] = order.apply(is_vip, axis='columns')
order

,user_id,product_id,date,amount,address,result,card-holder,order,VIP,status,vip
id,,,,,,,,,,,
1,3,9,2017-01-01,500,Seoul,confirm,KB,1,True,VIP,VIP
2,1,7,2017-01-03,700,Seoul,confirm,KB,2,True,VIP,VIP
3,3,8,2017-01-03,900,Daejeon,confirm,KB,3,True,VIP,VIP
4,4,2,2017-01-07,500,NaN,cancel,KB,4,False,None-VIP,VIP
5,7,3,2017-01-09,700,Incheon,confirm,KB,5,True,VIP,VIP
6,5,7,2017-01-09,600,Busan,cancel,KB,6,False,None-VIP,VIP
7,2,5,2017-01-10,200,NaN,cancel,KB,7,False,None-VIP,None-VIP

# 2.

## 정렬

In [43]:
url = 'https://bit.ly/dsa-01-order'

# order = pd.read_csv(url, index_col='id')
order = pd.read_csv(url)
order = order.set_index('id')
order

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [44]:
order.sort_index()
# order.sort_index(ascending=False)

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled

In [45]:
order.sort_values(by = 'price')

    user_id  product_id        date  price  address      state
id
7         2           5  2017-01-10    200      NaN   canceled
1         3           9  2017-01-01    500    Seoul  confirmed
4         4           2  2017-01-07    500      NaN   canceled
6         5           7  2017-01-09    600    Busan   canceled
2         1           7  2017-01-03    700    Seoul  confirmed
5         7           3  2017-01-09    700  Incheon  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed

In [46]:
order.sort_values(by=['date','price'])

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
4         4           2  2017-01-07    500      NaN   canceled
6         5           7  2017-01-09    600    Busan   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
7         2           5  2017-01-10    200      NaN   canceled

In [47]:
# 컬럼마다 오름차순 내림차순 다르게 설정 가능
order.sort_values(by=['date','price'], ascending=[True, False])

    user_id  product_id        date  price  address      state
id
1         3           9  2017-01-01    500    Seoul  confirmed
3         3           8  2017-01-03    900  Daejeon  confirmed
2         1           7  2017-01-03    700    Seoul  confirmed
4         4           2  2017-01-07    500      NaN   canceled
5         7           3  2017-01-09    700  Incheon  confirmed
6         5           7  2017-01-09    600    Busan   canceled
7         2           5  2017-01-10    200      NaN   canceled